let i=1,sum=0,even_number=0
while(i<=100){
    document.write(`${i} `)
    sum+=i
    if(i%2===0)
        even_number++
    i++
}
document.write(`<br>`)
document.write(`The sum of all numbers is ${sum}`)
document.write(`<br>`)
document.write(`The number of even numbers is ${even_number}`)
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
let response=prompt("你爱我吗？")
while(response!=='爱'){
    response=prompt("你爱我吗？")
}
alert("我也爱你")